<div id="for-home" class="product-char">
    <div class="container">
        <p><img src="{{ asset("/images/product-pic.svg") }}" width="220" height="202" alt=""></p>
        <p>{{ __("Почему Вам обязательно нужно попробовать массажное кресло") }}</p>
        <ul>
            <li>{{ __("Расслабляет всё и тело") }}</li>
            <li>{{ __("Снижает спазм в мышцах") }}</li>
            <li>{{ __("Снижает напряжение и стресс") }}</li>
            <li>{{ __("Улучшает кровообращение и общее самочувствие") }}</li>
            <li>{{ __("Способствует укреплению иммунитета") }}</li>
        </ul>
    </div>
</div>