@extends("layouts.front")

@section("content")

    <div id="info">
        <div class="container">
            <div class="info-message">
                <svg width="36" height="36" viewBox="0 0 36 36" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <g clip-path="url(#clip0_175_841)">
                        <path d="M35.3838 6.43962C35.2246 4.94956 34.5598 3.559 33.5002 2.49936C32.4405 1.43973 31.05 0.774952 29.5599 0.615673C21.875 -0.206201 14.1243 -0.206201 6.43938 0.615673C4.94932 0.774952 3.55875 1.43973 2.49912 2.49936C1.43949 3.559 0.774708 4.94956 0.615429 6.43962C-0.206445 14.1245 -0.206445 21.8752 0.615429 29.5601C0.774708 31.0502 1.43949 32.4408 2.49912 33.5004C3.55875 34.56 4.94932 35.2248 6.43938 35.3841C14.1243 36.206 21.875 36.206 29.5599 35.3841C31.05 35.2248 32.4405 34.56 33.5002 33.5004C34.5598 32.4408 35.2246 31.0502 35.3838 29.5601C36.2057 21.8752 36.2057 14.1245 35.3838 6.43962ZM26.9996 25.342L25.3417 26.9999L17.9996 19.6578L10.6575 26.9999L8.99964 25.342L16.3417 17.9999L8.99964 10.6578L10.6575 8.99988L17.9996 16.342L25.3417 8.99988L26.9996 10.6578L19.6575 17.9999L26.9996 25.342Z" fill="#B22D2D"></path>
                    </g>
                    <defs>
                        <clipPath id="clip0_175_841">
                            <rect width="36" height="36" fill="white"></rect>
                        </clipPath>
                    </defs>
                </svg>
                <span>{{ __("Связь с креслом") }}<br> {{ __("потеряна") }}</span>
            </div>
        </div>
    </div>

    <div id="info-text">
        <div class="container">
            <p>{{ __("Мы получили Ваш платёж, но, к сожалению, не смогли подключиться к креслу") }}.</p>
            <p>{{ __("Пожалуйста, попробуйте нажать на кнопку ниже через 1 минуту") }}:</p>
            <p><a class="btn" href="{{ route("payment.accept", ["order" => $order, "lang" => app()->getLocale()]) }}">{{ __("Запустить кресло") }}</a></p>
        </div>
    </div>

    <footer id="footer">
        <div class="container">
            <div class="feedback-wrapper">
                <p>{{ __("Заметили техническую неисправность?") }}<br> {{ __("Сообщите нам по телефону") }}:</p>
                <p><a href="tel:+371 267 467 04" class="phone"><svg width="19" height="19" viewBox="0 0 19 19" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M17.4754 12.4713C16.3121 12.4713 15.17 12.2894 14.0876 11.9317C13.5573 11.7508 12.9053 11.9168 12.5816 12.2492L10.4452 13.8619C7.96766 12.5394 6.44153 11.0138 5.13706 8.5548L6.70233 6.4741C7.109 6.06798 7.25486 5.47472 7.0801 4.91808C6.72089 3.83003 6.53841 2.6884 6.53841 1.52465C6.53846 0.683951 5.85451 0 5.01386 0H1.5246C0.683949 0 0 0.683951 0 1.5246C0 11.1607 7.83936 19 17.4754 19C18.3161 19 19 18.316 19 17.4754V13.9959C19 13.1553 18.316 12.4713 17.4754 12.4713Z" fill="#D7C6B2"></path>
                        </svg> +371 267 467 04</a></p>
            </div>
        </div>
    </footer>
@endsection